Revit 2024 API
IDuctFittingAndAccessoryPressureDropUIServer.ShowSettings Method
 Shows the settings UI.
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
bool ShowSettings(
	DuctFittingAndAccessoryPressureDropUIData data
)
Visual Basic
Function ShowSettings ( _
	data As DuctFittingAndAccessoryPressureDropUIData _
) As Boolean
Visual C++
bool ShowSettings(
	DuctFittingAndAccessoryPressureDropUIData^ data
)
Parameters
data
Type: Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData
 The input data of the calculation.
Return Value
 True if the user makes any changes in the UI, false otherwise.
See Also
IDuctFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Mechanical Namespace